Autodesk.Revit.DB.FabricationConfiguration.GetItemFoldersUsedByServices(System.Collections.Generic.IList{System.Int32})
Gets a list of fabrication item folders used by services.
Remarks:
To get the item folders, you may need to call
ReloadConfiguration first.
serviceIds:
list of service identifiers to check.
Returns:
Returns a list of fabrication item folders used by services.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The current fabrication configuration is not connected and updated to source configuration. Reload and try again.
Since:
2016

Autodesk.Revit.DB.FabricationConfiguration.GetMaterialType(System.Int32,System.Int32)
Gets material type from its material/gauge identifiers.
materialId:
The material identifier.
gaugeId:
The gauge identifier within the specified material.
Returns:
The material type of the material/gauge.
Since:
2025

Autodesk.Revit.DB.FabricationConfiguration.GetMaterialWireGauge(System.Int32,System.Int32)
Gets material wire gauge from its material/gauge identifiers.
materialId:
The material identifier.
gaugeId:
The gauge identifier within the specified material.
Returns:
The wire gauge of the material/gauge.
Since:
2025

Autodesk.Revit.DB.FabricationConfiguration.LoadItemFilesInternal(System.Collections.Generic.IList{System.String},System.Int32@)
Loads the specified fabrication item files into the project.
itemFiles:
The relative paths of the fabrication item files to load.
filesLoaded:
the number of files (items+images) reloaded
Returns:
The relative paths of the fabrication item files which failed to load.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The current fabrication configuration is not connected and updated to source configuration. Reload and try again.
-or-
this operation failed.
Since:
2019

Autodesk.Revit.DB.FabricationConfiguration.LoadServicesInternal(System.Collections.Generic.IList{System.Int32},System.Int32@)
Loads the specified fabrication services into the project.
serviceIds:
The identifiers of the fabrication services to load.
filesLoaded:
the number of files (items+images) reloaded
Returns:
The identifiers of the fabrication services which failed to load.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The current fabrication configuration is not connected and updated to source configuration. Reload and try again.
-or-
this operation failed.
Since:
2016

Autodesk.Revit.DB.FabricationConfiguration.SetUpdatedStraightsFromValidateConnections(System.Collections.Generic.ISet{Autodesk.Revit.DB.ElementId})
Set the set of element identifiers of fabrication part straights that were updated to remove gaps between connections.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2025

Autodesk.Revit.DB.FabricationConfiguration.GetItemFolders
Gets a list of fabrication item folders in the fabrication item folder structure.
Remarks:
To get the item folders, you may need to call
ReloadConfiguration first.
Returns:
Returns a list of fabrication item folders in the fabrication item folder structure.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The current fabrication configuration is not connected and updated to source configuration. Reload and try again.
Since:
2019

Autodesk.Revit.DB.FabricationConfiguration.GetUpdatedStraightsFromValidateConnections
Get the set of element identifiers of fabrication part straights that were previously updated. If there were no straights were updated it will return an empty set of element identifiers.
Remarks:
The set of element identifiers were created by calling ValidateConnectionsForAllFabricationParts with the option updateGapForStraights set to true.
Returns:
Returns the set of element identifiers of fabrication part straights that were updated.
Since:
2025

Autodesk.Revit.DB.FabricationConfiguration.PostReviewableWarningsForBadConnections(Autodesk.Revit.DB.ConnectionValidationInfo)
Reviewable warnings are created for all entries contained in the connection validation information.
info:
The connection information created from the connection validation check.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
this operation failed.
Since:
2025

Autodesk.Revit.DB.FabricationConfiguration.ValidateConnectionsForAllFabricationParts(System.Boolean)
Validates all fabrication part connections in the current project. Invalid connections found will be added to the connection validation information class. The validation checks for bad alignments or gaps, incompatible connection types, mismatches of size, mismatches of shapes.
Remarks:
If set to update straights any updated straights will be added to a set of element identifiers. Call GetUpdatedStraightsFromValidateConnections to get the set of element identifiers for the updated straights.
updateGapForStraights:
Attempt to update straights to remove the gap between the connctors.
Returns:
The information about the validation check.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
this operation failed.
Since:
2025

Autodesk.Revit.DB.FabricationConfiguration.CheckConnectionsForAllFabricationParts
Checks the connections for all fabrication parts in the current project. It will create reviewable warnings for all bad connections found. The checks are looking for bad alignments or gaps, incompatible connection types, mismatches of size, mismatches of shapes.
Returns:
The number of bad connections found.
Since:
2025